OpenFOAM/Case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    FrontAndBack
    {
        type            empty;
        physicalType    empty;
        nFaces          42492;
        startFace       32369;
    }
    patch1
    {
        type            wall;
        physicalType    wall;
        nFaces          48;
        startFace       74861;
    }
    patch2
    {
        type            wall;
        physicalType    wall;
        nFaces          48;
        startFace       74909;
    }
    patch3
    {
        type            wall;
        physicalType    wall;
        nFaces          48;
        startFace       74957;
    }
    Shaft
    {
        type            wall;
        physicalType    wall;
        nFaces          18;
        startFace       75005;
    }
    Inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          79;
        startFace       75023;
    }
    Lat-Wall
    {
        type            wall;
        physicalType    wall;
        nFaces          98;
        startFace       75102;
    }
    Outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          79;
        startFace       75200;
    }
    AMI-St
    {
	type cyclicAMI;
    neighbourPatch AMI-Rt;
    matchTolerance 1e-4;
    transform noOrdering;
        nFaces          119;
        startFace       75279;
    }
    AMI-Rt
    {
        type cyclicAMI;
    neighbourPatch AMI-St;
    matchTolerance 1e-4;
    transform noOrdering;
        nFaces          119;
        startFace       75398;
    }
)

// ************************************************************************* //
